import Header from "@/shared/blocks/Header"
import Footer from "@/shared/blocks/Footer";
import { ContainerLanguage , MainContainer } from "@/components/Containers/container";




export default function Page() {
    const UL = ({children,title}) => {
        return (
            <>
                <h2>{title}</h2>
                <ul style={{paddingLeft: "2rem"}} className="flex flex-col ">
                    {children && children}
                </ul>
            </>
        )
    }


    return (
    <ContainerLanguage>
      <Header></Header>
        <MainContainer>
            <section className="flex flex-col align-start" style={{padding: "1rem 0rem",gap: "1.5rem"}}>
                <h1>
                    Користувацька угода
                </h1>
                
                <span>Останнє оновлення: 03.07.2025</span>
                
                <span>Ласкаво просимо на сайт Kando (далі — «Сервіс»). Користуючись Сервісом, ви погоджуєтесь із цією Користувацькою угодою.</span>
            
                <h2>
                    1. Загальні положення
                </h2>
                <ul style={{paddingLeft: "2rem"}} className="flex flex-col">
                    <li>1.1. Власник Сервісу — фізична особа, яка надає платформу для розміщення та перегляду оголошень.</li>
                    <li>1.2. Ця Угода регулює відносини між Вами (користувачем) та Власником Сервісу.</li>
                    <li>1.3. Якщо ви не погоджуєтесь з умовами, будь ласка, не користуйтесь Сервісом.</li>  
                </ul>

                <h2>
                     2. Реєстрація та обліковий запис
                </h2>
                <ul style={{paddingLeft: "2rem"}} className="flex flex-col">
                    <li>2.1. Для розміщення оголошень необхідна реєстрація.</li>
                    <li>2.2. Ви погоджуєтесь надати правдиву та актуальну інформацію: ім’я, електронну адресу, фото (у разі входу через Google), адресу (за потреби) тощо.</li>
                    <li>2.3. Ви несете повну відповідальність за безпеку свого облікового запису.</li>
                </ul>

                <UL title={"3. Контент та поведінка"}>
                    <li>3.1. Ви зобов’язуєтесь не публікувати незаконний, шахрайський, образливий чи заборонений контент.</li>
                    <li>3.2. Kando має право видаляти будь-який контент або облікові записи без пояснень.</li>
                </UL>

                <UL title={"4. Збір даних"}>
                    <li>4.1. Ми збираємо та обробляємо особисті дані, які ви добровільно надаєте.</li>
                    <li>4.2. Дані можуть передаватися третім сторонам (наприклад, Google Analytics) для покращення роботи Сервісу.</li>
                    <li>4.3. Ви маєте право звернутися з запитом на зміну або видалення своїх даних.</li>
                </UL>
                <UL title={"5. Відповідальність"}>
                    <li>5.1. Власник не несе відповідальності за контент користувачів та можливі збитки.</li>
                    <li>5.2. Всі угоди укладаються між користувачами напряму.</li>
                    <li>5.3. Сервіс надається "як є" без гарантій.</li>
                </UL>
                <UL title={"6. Зміни угоди"}>
                    <li>6.1. Угода може бути змінена в будь-який момент.</li>
                    <li>6.2. Продовження використання Сервісу означає вашу згоду з оновленнями.</li>
                </UL>
            </section>
        </MainContainer>
      <Footer></Footer>
    </ContainerLanguage>
    )
}