//************************************************************************************************/
//*************************** CONFIG FILE FOR CONST VARIABLES ************************************/
//************************************************************************************************/

export const BACKEND_URL = process.env.NEXT_PUBLIC_BACKEND_URL_URL || "http://localhost:4000";

export const categoryCONST = {
    realestate: "нерухомість",
    cloth: "одяг",
} 


// city ukraine


export const UkraineCities = [
    "Київ", "Харків", "Одеса", "Дніпро", "Львів",
    "Запоріжжя", "Кривий Ріг", "Миколаїв", "Маріуполь", "Вінниця",
    "Херсон", "Полтава", "Чернігів", "Черкаси", "Суми",
    "Житомир", "Хмельницький", "Рівне", "Тернопіль", "Івано-Франківськ",
    "Ужгород", "Луцьк", "Кропивницький", "Чернівці", "Бровари",
    "Кам’янське", "Біла Церква", "Мелітополь", "Краматорськ", "Бердянськ",
    "Сєвєродонецьк", "Павлоград", "Нікополь", "Слов’янськ", "Умань",
    "Мукачево", "Алчевськ", "Лисичанськ", "Кременчук", "Конотоп"
];


  
export const CategoryList = [
  "Нерухомість","Одяг","Техніка","Різне","Меблі"  
]


export const SubCategory = {
    "Нерухомість": [
      "🏢 Квартири","🛌🏿 Кімнати",
      "🏠 Будинки","⏰ Подобова оренда житла",
      "🌍 ділянка","🅿️ Гараж, паркінг",
    ],
    "Одяг": [
      "👔 Чоловічий одяг", "👗 Жіночий одяг",
      "👟 Взуття", "👜 Аксесуари",
      "🧥 Верхній одяг", "🩳 Домашній одяг"
    ],
    "Техніка": [
      "📱 Смартфони та телефони",
      "💻 Ноутбуки та комп'ютери",
      "🖨️ Принтери, сканери",
      "🖥️ Монітори",
      "📷 Фото- та відеотехніка",
      "📺 Телевізори та медіа",
      "📡 Роутери, мережеве обладнання",
      "🎧 Аудіотехніка та навушники",
      "🔋 Зарядки, кабелі, аксесуари",
      "📟 Побутова техніка"
    ],
    "Різне": [
      "🧸 Іграшки та настільні ігри",
      "🎨 Творчість і хобі",
      "📚 Книги та журнали",
      "🎺 Музичні інструменти",
      "🧳 Туризм та кемпінг",
      "🎁 Подарунки та сувеніри",
      "🕯️ Антикваріат",
      "📼 Колекціонування",
      "🔧 Інструменти та приладдя",
      "🧴 Косметика та догляд",
      "🪞 Дзеркала, декор та інше",
    ],
    "Меблі": [
      "🛋️ Дивани",
      "🪑 Крісла",
      "🪵 Столи",
      "🪑 Стільці",
      "🚪 Шафи",
      "🛏️ Ліжка",
      "🧰 Комоди",
      "🗄️ Тумбочки",
      "🍽️ Кухонні меблі",
      "💼 Офісні меблі",
      "🧸 Дитячі меблі"
    ]
}

export const subCategoryUrl = {
    "neruhomist": [
      "kvartyry", "kimnaty",
      "budynky", "posutochna-orenda",
      "zemlya", "garazhy"
    ],
    "odyah": [
      "cholovichyy", "zhinochyy",
      "vzuttya", "aksesuary",
      "verkhniy-odyah", "domashniy-odyah"
    ],
    "tehnika": [
      "smartfony-telefony",
      "noutbuky-kompyutery",
      "pryntery-skanery",
      "monitory",
      "foto-video",
      "televizory-media",
      "routery-merezheve",
      "audio-navushnyky",
      "zaryadky-kabeli",
      "pobutova-tehnika"
    ],
    "rizne": [
      "igrashky", "tvorchist-hobi", "knygy-zhurnaly",
      "muzychni-instrumenty", "turystyk-kemping",
      "suveniry", "antyky", "kolektsionuvannya",
      "instrumenty",
      "kosmetyka-doglyad", "dekor-ta-inshe"
    ],
    "mebli": [
      "divany", "krisla", "stoly", "stіlci", "shafy",
      "lizhka", "komody", "tumbochky", "kuhni",
      "ofisni-mebli", "dytiachi-mebli"
    ],
  } 

    
  

  export const subCategoryUrls = {
    "neruhomist": "Нерухомість",
    "kvartyry": "Квартири", 
    "kimnaty": "Кімнати",
    "budynky": "Будинки", 
    "posutochna-orenda": "Подобова оренда житла",
    "zemlya": "Земля",
    "garazhy": "Гаражи, паркінг",
    "odyah": "Одяг",
    "cholovichyy": "Чоловічий одяг", 
    "zhinochyy": "Жіночий одяг",
    "vzuttya": "Взуття", 
    "aksesuary": "Аксесуари",
    "verkhniy-odyah": "Верхній одяг", 
    "domashniy-odyah": "Домашній одяг",
    "rizne": "Різне",
    "igrashky": "Іграшки та настільні ігри", 
    "tvorchist-hobi": "Творчість і хобі", 
    "knygy-zhurnaly": "Книги та журнали",
    "muzychni-instrumenty":"Музичні інструменти",  
    "turystyk-kemping": "Туризм та кемпінг",
    "suveniry": "Подарунки та сувеніри", 
    "antyky": "Антикваріат",
    "kolektsionuvannya": "Колекціонування",
    "instrumenty": "Інструменти та приладдя", 
    "kosmetyka-doglyad": "Косметика та догляд",
    "dekor-ta-inshe": "Дзеркала, декор та інше",
    "tehnika": "Техніка",   
    "smartfony-telefony": "Смартфони та телефони",
    "noutbuky-kompyutery": "Ноутбуки та комп'ютери",
    "pryntery-skanery": "Принтери, сканери",
    "monitory": "Монітори",
    "foto-video": "Фото- та відеотехніка",
    "televizory-media": "Телевізори та медіа",
    "routery-merezheve": "Роутери, мережеве обладнання",
    "audio-navushnyky": "Аудіотехніка та навушники",
    "zaryadky-kabeli": "Зарядки, кабелі, аксесуари",
    "pobutova-tehnika": "Побутова техніка",
    "mebli": "Меблі",
    "divany": "Дивани", 
    "krisla": "Крісла", 
    "stoly": "Столи", 
    "stіlci": "Стільці", 
    "shafy": "Шафи",
    "lizhka": "Ліжка", 
    "komody": "Комоди",
    "tumbochky": "Тумбочки", 
    "kuhni": "Кухонні меблі",
    "ofisni-mebli": "Офісні меблі",
    "dytiachi-mebli": "Дитячі меблі"
}


export const categoryList = {
    "Нерухомість": [
        {
            text: "Площа, м²",
            name: "totalplace",
            placeholder: "40",
        },
        {
            text: "Площа Кухні, м²",
            name: "kitchenplace",
            placeholder: "15"
        },
        {
            text: "Рік будівництва",
            name: "yearconstruction",
            placeholder: "2007"
        },
        {
            text: "Ремонт",
            name: "state",
            placeholder: ["Євро Ремонт","Після ремонту","Під ремонт","Косметичний Ремонт","Авторський Ремонт"]
        },
        {
            text: "Відео огляд",
            name: "reviewvideo",
            placeholder: "https://www.youtube.com/"
        },
        {
            text: "Працюю з рієлторами",
            name: "workwithagents",
            placeholder: ["Ні","Працюю з рієлторами"]
        },
        {
            text: "Поверх",
            name: "floor",
            placeholder: "17"
        },
        {
            text: "Поверховість",
            name: "totalfloor",
            placeholder: "17"
        },
        {
            text: "Район",
            name: "region",
            placeholder: ["Київскій район","Пересипський район","Приморський район","Хаджибейский район"]
        },
        {
            text: "Планування",
            name: "objectplane",
            placeholder: ["Роздільно","Суміжно Прохідна","Студія","Смарт","Пентхаус"]
        },
        {
            text: "Санвузол",
            name: "bathroom",
            placeholder: ["Роздільний","Суміжний","2 і більше"]
        },
        {
            text: "Опалення",
            name: "heating",
            placeholder: ["Централізоване","Власна котельня","Індивідуальне Газове","Індивідуальне Електро","Інше"]
        }
    ],
    "Одяг": [
        {
            text: "Розмір одягу",
            name: "size",
            placeholder: ["XSS","XS","S","M","L","XL","XXL"]
        },
        {
            text: "Відео огляд",
            name: "reviewvideo",
            placeholder: "https://www.youtube.com/"
        },
    ],
    "Різне": [

    ], 
    "Техніка": [

    ],
    "Меблі": [

    ]
}


export const HeadInputList = {
    "Нерухомість": [
        {
            text: "Тип угоди",
            name: "typeagreement",
            placeholder: ["Оренда","Долгосрочна Оренда","Продаж"]
        },
        {
            text: "Оберіть Місто",
            require: true,
            placeholder: "city",
            placeholder: UkraineCities
        },
        {
            text: "Кількість Кімнат",
            reqiure: true,
            name: "totalrooms",
            placeholder: ["1","2","3","4","5","5+"]
        },
    ],
    "Одяг": [
        {
            text: "Розмір одягу",
            name: "size",
            placeholder: ["XSS","XS","S","M","L","XL","XXL"]
        },
    ],
    "Різне": [

    ],
    "Техніка": [

    ],
    "Меблі": [
      
    ]
}


// ********************************************************************************
// ****************************** language ****************************************
// ********************************************************************************


const UkraineLang = {
    language: "Мова",
    trash: "Кошик",
    likes: "Обрані",    
    i: "Я",
    sort: "Сортувати",
    category: "категорії",
    title: "Створюй разом з "
}

const EnglishLang = {
    language: "Language",
    trash: "Trash",
    likes: "Likes",
    i: "I",
    sort: "Sort",
    category: "category",
    title: "Create with a"
}


export const Language = {
    "ua": UkraineLang,
    "en": EnglishLang
}




export const subCategoryObject = {
    "apartments": "🏢 Квартири",
    "rooms": "🛌🏿 Кімнати",
    "houses": "🏠 Будинки",
    "daily": "⏰ Подобова оренда житла",
    "land": "🌍 ділянка",
    "garage-parking": "🅿️ Гараж, паркінг",
    "men-clothing": "👔 Чоловічий одяг",
    "women-clothing": "👗 Жіночий одяг",
    "shoes": "👟 Взуття",
    "accessories": "👜 Аксесуари",
    "outerwear": "🧥 Верхній одяг",
    "homewear": "🩳 Домашній одяг"
}


export const searchParams = [
    {
        text: "По площі",
        name: "totalplace",
        placeholder: [30,40,50,60,70,80,90,100],
    },
    {
        text: "Рік будівництва",
        name: "yearconstruction",
        placeholder: ["1980","1990","2000","2010","2020+"]
    },
    {
        text: "Тип будинку",
        name: "typeofhouse",
        placeholder: ["Чешка","Гостинка","Совмін","Гуртожиток"]
    },
    {
        text: "Район",
        name: "region",
        placeholder: ["Київській район","Пересипський район","Приморський район","Хаджибейьский район"]
    },
    {
        text: "Працюю з рієлторами",
        name: "workwithagents",
        placeholder: ["Всі оголошення","Працюю з рієлторами"]
    },
    {
        text: "Стан",
        name: "state",
        placeholder: ["Після ремонту","Євро Ремонт","Під ремонт"]
    },
    {
        text: "Ціна",
        name: "price",
        placeholder: ["2000","3000","4000","5000","6000","7000","8000+"]    
    },
    {
        text: "Поверх",
        name: "floor",
        placeholder: "10"
    },
]

export const includeSearchName = {
    "сдам": ["Нерухомість","Долгосрочна Оренда"]
}





export const objectInfoCategories = {
    "Нерухомість": [
        {
            title: "Меблювання", arr: [
                "з меблями",
                "без меблів"
            ]
        },
        {
            title: "Домашні Улюбленці", arr: [
                "ні",
                "так,кіт",
                "так,маленький пес",
                "так,середній пес",
            ]
        },
        {
            title: "Автономність при блекауті", arr: [
                "Працює інтернет",
                "Працює ліфт",
                "Працює",
                "Працює опалення",
                "Резервне підключення"  
            ]
        },
        {title: "Побутова Техінка",arr: [
            "Електрочайник", 
            "Кавомашина",
            "Фен",
            "Плита",
            "Варильна панель", 
            "Духова шафа", 
            "Мікрохвильова піч", 
            "Мультиварка",
            "Холодильник",
            "Посудомийна машина",
            "Пральна машина"
        ]},
        {title: "Мультимедіа",arr: [
            "Wi-Fi",
            "Швидкісний інтернет",
            "Телевізор",
            "Кабельне, цифрове ТБ",
            "Супутникове ТБ",
            "Без мультимедіа",
        ]},
        {title: "Комфорт",arr: [
            "Кондиціонер",
            "Підігрів підлоги ",
            "Ванна ",
            "Душова кабіна ",
            "Меблі на кухні ",
            "Гардероб ",
            "Балкон, лоджія ",
            "Tepaca ",
            "Панорамні вікна ",
            "Грати на вікнах ",
            "Сигналізація",
            "Конс'ерж",
            "Охорона території",
            "Паркувальне місце",
            "Гостьовий паркінг",
            "Підземний паркінг",
            "Гараж",
            "Ліфт",
            "Грузовий ліфт",
            "Госп. приміщення, комора", 
            "Технологія розумний будинок", 
            "Автономний електрогенератор",
        ]},
        {title: "Комунікації",arr: [
            "Газ",
            "Центральний водопровід", 
            "Скважина",
            "Електрика",
            "Центральна каналізація", 
            "Каналізація септик",
            "Вивіз відходів",
            "Асфальтована дорога",
            "Без комунікацій",
        ]},
        {title: "Інфраструктура (до 500 метрів)",arr: [
            "Дитячий майданчик",
            "Аптека",
            "Лікарня, поліклініка",
            "Центр міста",
            "Ресторан, кафе",
            "Кінотеатр, театр",
            "Відділення пошти",
            "Відділення банку, банкомат",
            "Автовокзал",
            "Залізнична станція",
            "Дитячий садок",
            "Школа", 
            "Бювет", 
            "Зупинка транспорту",
            "Метро", 
            "Ринок",
            "Магазин, кіock",
            "Супермаркет, ТРЦ", 
            "Парк, зелена зона", 
            "Дитячий майданчик",
        ]},
        {title: "Ландшафт (до 1 км)",arr: [
            "Річка",
            "Водосховище",
            "Озеро", 
            "Mope", 
            "Острови", 
            "Пагорби", 
            "Гори", 
            "Парк", 
            "Ліс",
        ]},
        {title: "Також",arr: [
            "Тільки сім'ям",
            "3 господарями",
            "Можна студентам", 
            "Можна іноземцям",
            "Можна з дітьми",
            "Можна курити",
        ]},
    ],
    "Одяг": [
        {
          title: "Тип", arr: [
            "Футболки, топи",
            "Сорочки, блузи",
            "Светри, кофти",
            "Куртки, пальта",
            "Штани, джинси",
            "Спідниці, шорти",
            "Сукні, комбінезони",
            "Спортивний одяг",
            "Домашній одяг",
            "Білизна",
            "Верхній одяг",
            "Діловий одяг"
          ]
        },
        {
          title: "Стать", arr: [
            "Жіночий",
            "Чоловічий",
            "Унісекс",
            "Дитячий"
          ]
        },
        {
          title: "Стан", arr: [
            "Нове з бірками",
            "Нове без бірок",
            "Б/в, у гарному стані",
            "Б/в, є дефекти"
          ]
        },
        {
          title: "Сезон", arr: [
            "Зима",
            "Весна",
            "Літо",
            "Осінь",
            "Універсальний"
          ]
        },
        {
          title: "Матеріал", arr: [
            "Бавовна",
            "Льон",
            "Шерсть",
            "Поліестер",
            "Шовк",
            "Джинс",
            "Екошкіра / шкіра",
            "Інше"
          ]
        },
        {
          title: "Колір", arr: [
            "Чорний",
            "Білий",
            "Сірий",
            "Синій",
            "Червоний",
            "Зелений",
            "Жовтий",
            "Бежевий",
            "Рожевий",
            "Фіолетовий",
            "Інше"
          ]
        },
        {
          title: "Додатково", arr: [
            "Оверсайз",
            "З етикеткою",
            "Фірмовий бренд",
            "Зроблено в Україні",
            "Підходить для подарунку"
          ]
        }          
    ],
    "Різне": [
        {
        title: "Стан", arr: [
          "Нове",
          "Майже нове",
          "Б/в",
          "Колекційний стан"
        ]
      },
      {
        title: "Тип товару", arr: [
          "Ручна робота",
          "Фабричне виробництво",
          "Раритет / Антикваріат",
          "Ексклюзив",
          "Мас-маркет"
        ]
      },
      {
        title: "Матеріал", arr: [
          "Дерево",
          "Метал",
          "Пластик",
          "Кераміка",
          "Тканина",
          "Папір / Картон"
        ]
      },
      {
        title: "Для кого", arr: [
          "Діти",
          "Підлітки",
          "Дорослі",
          "Універсальний"
        ]
      }          
    ],
    "Техніка": [
        {
            title: "Стан", arr: [
              "Нова",
              "Б/в, в ідеальному стані",
              "Б/в, робоча",
              "Потребує ремонту"
            ]
          },
          {
            title: "Гарантія", arr: [
              "Є гарантія",
              "Без гарантії",
              "На залишковій гарантії"
            ]
          },
          {
            title: "Комплектація", arr: [
              "Повна комплектація",
              "Без коробки",
              "Без зарядного пристрою",
              "Документи в наявності"
            ]
          },
          {
            title: "Тип живлення", arr: [
              "Акумулятор",
              "Мережа 220V",
              "Батарейки",
              "USB / Type-C"
            ]
          },
          {
            title: "Додатково", arr: [
              "Підтримує Bluetooth",
              "Підтримує Wi-Fi",
              "Сенсорний екран",
              "Водозахист",
              "З чохлом"
            ]
          }
          
    ],
    "Меблі": [
      {title: "Тип меблів", arr: [
        "Ліжка",
        "Дивани",
        "Крісла",
        "Стільці",
        "Стіл",
        "Шафа",
        "Комод",
        "Тумба",
        "Полиці",
        "Письмовий стіл",
        "Кухонний гарнітур",
        "Комп'ютерний стіл",
        "Журнальний стіл",
        "Барна стійка",
        "Пуфи",
        "Лавки",
        "Стелажі"
      ]},
      {title: "Призначення", arr: [
          "Для спальні",
          "Для вітальні",
          "Для кухні",
          "Для офісу",
          "Для дитячої кімнати",
          "Для ванної",
          "Для балкона",
          "Для саду",
          "Для передпокою",
          "Для магазину",
      ]},
      {title: "Стан", arr: [
          "Нова",
          "Майже нова",
          "Вживана",
          "Потребує ремонту",
          "Антикварна"
      ]},
      {title: "Матеріал", arr: [
          "Дерево",
          "МДФ/ДСП",
          "Метал",
          "Скло",
          "Пластик",
          "Тканина",
          "Шкіра (натуральна)",
          "Штучна шкіра",
          "Комбінований"
      ]},
      {title: "Стиль", arr: [
          "Сучасний",
          "Класичний",
          "Мінімалізм",
          "Лофт",
          "Скандинавський",
          "Прованс",
          "Хай-тек",
          "Ретро",
          "Еко-стиль"
      ]},
      {title: "Колір", arr: [
          "Білий",
          "Чорний",
          "Сірий",
          "Коричневий",
          "Бежевий",
          "Дерев'яний",
          "Синій",
          "Зелений",
          "Жовтий",
          "Різнокольоровий"
      ]},
      {title: "Особливості", arr: [
          "З місцем для зберігання",
          "Розкладний механізм",
          "Модульна конструкція",
          "На колесах",
          "З підсвіткою",
          "Ортопедичний матрац",
          "З масиву дерева"
      ]},
      {title: "Доставка", arr: [
          "Самовивіз",
          "Доставка по місту",
          "Доставка по Україні",
          "Можна домовитися"
      ]}
    ]
}


